<?php

return [
    'roles' => [
        'title' => 'نوع المستخدم',
        'permissions_number' => 'عدد الصلاحيات',
        'users_number' => 'عدد المسجلين في الدور',
        'permissions' => 'الصلاحيات:',
        'success' => [
            'create' => 'نجح إنشاء نوع مستخدم جديد',
            'update' => 'نجح تعديل نوع المستخدم',
        ],
        'failure' => 'فشل إنشاء نوع المستخدم',
        'create' => 'إضافة نوع مستخدم',
        'edit' => 'تعديل نوع مستخدم',
    ],

    'students' => [
        'name' => 'اسم الطالب',
        'gender' => 'النوع',
        'credits' => 'الساعات المكتسبة',
        'level' => 'المرحلة',
        'gpa' => 'GPA',
        'success' => [
            'create' => 'نجح إنشاء طالب جديد',
            'update' => 'نجح تعديل بيانات الطالب',
        ],
        'create' => 'إضافة طالب',
        'show' => 'عرض بيانات الطالب',
        'edit' => 'تعديل البيانات',
        'index' => 'عرض الطلاب',
    ]
];
