<?php

return [
    'roles' => [
        'title' => 'نوع المستخدم',
        'permissions_number' => 'عدد الصلاحيات',
        'users_number' => 'عدد المسجلين في الدور',
        'permissions' => 'الصلاحيات:',
        'success' => [
            'create' => 'نجح إنشاء نوع مستخدم جديد',
            'update' => 'نجح تعديل نوع المستخدم',
        ],
        'failure' => 'فشل إنشاء نوع المستخدم',
        'create' => 'إضافة نوع مستخدم',
        'edit' => 'تعديل نوع مستخدم',
    ],

    'students' => [
        'name' => 'اسم الطالب',
        'gender' => 'النوع',
        'credits' => 'الساعات المكتسبة',
        'level' => 'المرحلة',
        'gpa' => 'GPA',
        'success' => [
            'store' => 'نجح إنشاء طالب جديد',
            'update' => 'نجح تعديل بيانات الطالب',
        ],
        'create' => 'إضافة طالب',
        'show' => 'عرض بيانات الطالب',
        'edit' => 'تعديل البيانات',
        'index' => 'عرض الطلاب',
        'empty' => 'لا يوجد طلّاب للعرض',
    ],

    'professors' => [
        'professor' => 'المعلم',
    ],

    'courses' => [
        'course' => 'المقرر',
        'name_en' => 'الاسم بالإنجليزية',
        'name_ar' => 'الاسم بالعربية',
        'code' => 'الكود',
        'level' => 'المستوى',
        'index' => 'عرض المقررات الدراسية',
        'create' => 'إضافة مقرر',
        'edit' => 'تعديل بيانات المقرر',
        'show' => 'عرض بيانات المقرر',
        'success' => [
            'create' => 'نجح إنشاء مقرر جديد',
            'update' => 'نجح تعديل المقرر',
        ],
        'schedule' => 'الجدول الدراسي',
        'add_schedule' => 'إضافة مقرر يوم :day الفترة :period',
        'empty' => 'لا توجد مقررات للعرض',
    ],

    'halls' => [
        'hall' => 'القاعة',
        'name' => 'اسم القاعة',
        'address' => 'المكان',
        'type' => 'نوع القاعة',
        'create' => 'إضافة قاعة جديدة',
        'edit' => 'تعديل بيانات القاعة',
        'index' => 'عرض قاعات الدراسة',
        'show' => 'عرض بيانات القاعة',
        'delete' => 'حذف القاعة',
        'types' => [
            'theatre' => 'مدرّج',
            'lab' => 'معمل',
        ],
        'status' => [
            'title' => 'الحالة',
            'available' => 'متاح',
            'under_maintenance' => 'قيد الصيانة',
            'reserved' => 'محفوظة',
        ],
        'success' => [
            'store' => 'أُضيفت قاعة جديدة بنجاح',
            'update' => 'حُدّثت بيانات القاعة بنجاح',
            'delete' => 'حُذفت القاعة بنجاح',
        ],
        'empty' => 'لا يوجد قاعات للعرض',
    ],

    'semester' => [
        'success' => [
            'start' => 'بُدء فصل دراسي جديد',
            'end' => 'أُنهي الفصل الدراسي الحالي',
        ],
    ]

];
