<?php

return [
    'admins' => [
        'title'  => 'المشرفون',
        'index'   => 'عرض المشرفين',
        'create' => 'إضافة مشرف',
        'edit'   => 'تعديل مشرف',
    ],

    'moderators' => [
        'title'  => 'أعضاء الإدارة',
        'index'  => 'عرض أعضاء الإدارة',
        'create' => 'إضافة عضو',
        'edit'   => 'تعديل عضو',
    ],

    'professors' => [
        'title'  => 'المعلمون',
        'index'  => 'عرض المعلمين',
        'create' => 'إضافة معلم',
        'edit'   => 'تعديل المعلم',
    ],

    'students' => [
        'title'  => 'الطلاب',
        'index'   => 'عرض الطلاب',
        'create' => 'إضافة طالب',
        'transfer' => 'إضافة طالب مُحوّل',
        'edit'   => 'تعديل الطالب',
    ],

    'roles' => [
        'title'  => 'الأدوار',
        'index'   => 'عرض الأدوار',
        'create' => 'إضافة دور',
        'edit'   => 'تعديل الدور',
    ],

    'courses' => [
        'title'  => 'المقررات',
        'index'   => 'عرض المقررات',
        'create' => 'إضافة مقرر',
        'edit'   => 'تعديل المقرر',
        'schedule' => 'الجدول الدراسي',
        'student-schedule' => 'جدول المقررات المسجلة',
        'requests' => 'طلبات المقررات',
        'my-courses' => 'مقرراتي',
        'student-show' => 'مقررات الفصل الحالي',
        'professor-show' => 'مقررات التدريس',
        'requests-stats' => 'إحصائيات الطلبات',
    ],

    'halls' => [
        'title' => 'قاعات الدراسة',
        'index' => 'عرض القاعات',
        'create' => 'إضافة قاعة جديدة',
        'edit' => 'تعديل بيانات القاعة',
    ],

    'semester' => 'الفصل الدراسي',

    'quizzes' => [
        'title' => 'الامتحانات',
        'create' => 'إنشاء امتحان',
        'edit' => 'تعديل الامتحان',
        'index' => 'عرض امتحانات المقرر',
        'index-student' => 'عرض الامتحانات',
    ],

    'exam_schedule_generate' => 'إنشاء جدول الامتحانات',

];
