<?php

return [
    'admins' => [
        'title'  => 'المشرفون',
        'index'   => 'عرض المشرفين',
        'create' => 'إضافة مشرف',
        'edit'   => 'تعديل مشرف',
    ],

    'moderators' => [
        'title'  => 'المديرون',
        'index'   => 'عرض المديرين',
        'create' => 'إضافة مدير',
        'edit'   => 'تعديل مدير',
    ],

    'professors' => [
        'title'  => 'المعلمون',
        'index'  => 'عرض المعلمين',
        'create' => 'إضافة معلم',
        'edit'   => 'تعديل المعلم',
    ],

    'students' => [
        'title'  => 'الطلاب',
        'index'   => 'عرض الطلاب',
        'create' => 'إضافة طالب',
        'edit'   => 'تعديل الطالب',
    ],

    'roles' => [
        'title'  => 'الأدوار',
        'index'   => 'عرض الأدوار',
        'create' => 'إضافة دور',
        'edit'   => 'تعديل الدور',
    ],

    'courses' => [
        'title'  => 'المقررات',
        'index'   => 'عرض المقررات',
        'create' => 'إضافة مقرر',
        'edit'   => 'تعديل المقرر',
    ]

];
