<?php

return [
    'admins' => [
        'title'  => 'المشرفون',
        'index'   => 'عرض المشرفين',
        'create' => 'إضافة مشرف',
        'edit'   => 'تعديل مشرف',
    ],

    'moderators' => [
        'title'  => 'أعضاء الإدارة',
        'index'  => 'عرض أعضاء الإدارة',
        'create' => 'إضافة عضو',
        'edit'   => 'تعديل عضو',
    ],

    'professors' => [
        'title'  => 'المعلمون',
        'index'  => 'عرض المعلمين',
        'create' => 'إضافة معلم',
        'edit'   => 'تعديل المعلم',
    ],

    'students' => [
        'title'  => 'الطلاب',
        'index'   => 'عرض الطلاب',
        'create' => 'إضافة طالب',
        'transfer' => 'إضافة طالب مُحوّل',
        'edit'   => 'تعديل الطالب',
    ],

    'roles' => [
        'title'  => 'الأدوار',
        'index'   => 'عرض الأدوار',
        'create' => 'إضافة دور',
        'edit'   => 'تعديل الدور',
    ],

    'courses' => [
        'title'  => 'المقررات',
        'index'   => 'عرض المقررات',
        'create' => 'إضافة مقرر',
        'edit'   => 'تعديل المقرر',
        'schedule' => 'الجدول الدراسي',
    ],

    'halls' => [
        'title' => 'قاعات الدراسة',
        'index' => 'عرض القاعات',
        'create' => 'إضافة قاعة جديدة',
        'edit' => 'تعديل بيانات القاعة',
    ],

    'semester' => 'الفصل الدراسي',

];
