<?php

return [
    'admins' => [
        'title'  => 'المشرفون',
        'index'   => 'قائمة المشرفين',
        'create' => 'إضافة مشرف',
        'edit'   => 'تعديل مشرف',
    ],

    'moderators' => [
        'title'  => 'أعضاء الإدارة',
        'index'  => 'قائمة أعضاء الإدارة',
        'create' => 'إضافة عضو',
        'edit'   => 'تعديل عضو',
    ],

    'professors' => [
        'title'  => 'المعلمون',
        'index'  => 'قائمة المعلمين',
        'create' => 'إضافة معلم',
        'edit'   => 'تعديل المعلم',
    ],

    'students' => [
        'title'  => 'الطلاب',
        'index'   => 'قائمة الطلاب',
        'create' => 'إضافة طالب',
        'transfer' => 'إضافة طالب مُحوّل',
        'edit'   => 'تعديل الطالب',
        'guidence' => 'الإرشاد الأكاديمي',
        'enrollments' => 'تقدريات المقررات',
    ],

    'roles' => [
        'title'  => 'الأدوار',
        'index'   => 'قائمة الأدوار',
        'create' => 'إضافة دور',
        'edit'   => 'تعديل الدور',
    ],

    'courses' => [
        'title'  => 'المقررات',
        'index'   => 'قائمة المقررات',
        'create' => 'إضافة مقرر',
        'edit'   => 'تعديل المقرر',
        'schedule' => 'الجدول الدراسي',
        'student-schedule' => 'جدول المقررات المسجلة',
        'requests' => 'طلبات المقررات',
        'my-courses' => 'مقرراتي',
        'student-show' => 'مقررات الفصل الحالي',
        'professor-show' => 'مقررات التدريس',
        'requests-stats' => 'إحصائيات الطلبات',
        'all-enrollments' => 'تقدريات المقررات',
    ],

    'halls' => [
        'title' => 'قاعات الدراسة',
        'index' => 'قائمة القاعات',
        'create' => 'إضافة قاعة جديدة',
        'edit' => 'تعديل بيانات القاعة',
    ],

    'semester' => 'الفصل الدراسي',

    'quizzes' => [
        'title' => 'الامتحانات',
        'create' => 'إنشاء امتحان',
        'edit' => 'تعديل الامتحان',
        'index' => 'قائمة امتحانات المقرر',
        'index-student' => 'قائمة الامتحانات',
    ],

    'reports' => [
        'request' => 'طلب وثيقة',
        'requests' => 'طلبات الوثائق',
        'index' => 'طلبات الوثائق',
        'receipt_register' => 'تسجيل دفع فاتورة',
    ],

    'exam_schedule_generate' => 'إنشاء جدول الامتحانات',

];
